docs: add mermaid diagrams
